{
  "code": "en",
  "data": {
    "txCost_approve": ["1. Transaction fee only"],
    "txCost_apply": ["1. Transaction fee", "2. Deposit"],
    "txCost_challenge": ["1. Transaction fee", "2. Deposit"],

    "ins_approve_registry": "Approve the Registry contract to transfer your tokens",
    "ins_approve_voting": "Approve the Voting contract to transfer your tokens",
    "ins_apply": "Starting an application requires a minimum deposit of",
    "ins_challenge":
      "Challenging a listing application requires you to stake tokens. Once challenged, the application will go into the voting process",
    "ins_commitVote":
      "Enter how many tokens you wish to commit your vote to SUPPORT or OPPOSE the listing applicant. You will be given the opportunity to download a file which contains your secret vote information. Hold onto this file! You will need it to reveal your secret vote.",
    "ins_revealVote":
      "In order to reveal your previously committed vote, upload the commit's JSON file or enter the commit's information in the fields below.",
    "ins_updateStatus":
      "Update a listing's status to the registry, or resolve a challenge if one exists",
    "ins_claimVoterReward": "Upload the reveal file to claim your reward",
    "ins_requestVotingRights": "Transfer tokens to the voting contract",
    "ins_withdrawVotingRights": "Transfer tokens from the voting contract",
    "ins_rescueTokens": "Rescue tokens from a poll that you committed in, but did not reveal in",

    "mm_approve": "After you click approve, MetaMask will prompt you to confirm the approval",
    "mm_apply": "After you click submit, MetaMask will prompt you to confirm your application",
    "mm_challenge":
      "After you click challenge, MetaMask will prompt you to confirm the transaction",

    "details_apply": [
      "You can deposit more than the minimum deposit",
      "Your deposit stays with the application",
      "Applications take 3 days, during which any token-holder can challenge your listing application",
      "If no challenges, your listing will be added to the registry",
      "Challenges cost minDeposit",
      "A challenge forces a listing into the voting period",
      "Voting period takes 6 days, during which time your deposit will be locked until the end of the voting period",
      "If you win the challenge, you will not only get added to the registry, but also win a percentage of the challenger's stake",
      "If you lose the challenge, you will forfeit minDeposit of your total deposit, and any additional deposit can be retrieved by you",
      "If you want to retreive your deposit once added to the registry, you can do so at any time",
      "However your listing will be removed at that time as well"
    ]
  }
}
